import {
  CardRarity,
  ICardConstructorOptions,
  IDeckConstructor,
} from '@/models/types'

type CardArray = [string, CardRarity, number]
type ArrayOfCardArrays = CardArray[]

function transformCardArray(
  type: ICardConstructorOptions['type'],
  array: ArrayOfCardArrays
): IDeckConstructor['cards'] {
  return array.map((arr) => ({
    type,
    value: arr[0],
    rarity: arr[1],
    count: arr[2],
  }))
}

export const truthArray: ArrayOfCardArrays = [
  [
    'Истината трябва да излезе на яве! {{randomPlayer}} трябва да те попита нещо.',
    'COMMON',
    20,
  ],
  ['Кой ти беше първата бройка?', 'COMMON', 10],
  ['Какво е нещо, което не искаш родителите ти да знаят?', 'COMMON', 10],
  ['Какво е нещото, за което само няколко хора знаят?', 'COMMON', 10],
  ['Коя е най-голямата лъжа, която си казвал?', 'COMMON', 1],
  ['С кого си искал да спиш от 8-ми до 12-ти клас', 'RARE', 3],
  ['Ако можеше да спиш с {{randomPlayer}}, щеше ли?', 'RARE', 3],
  ['Кога плака за последно?', 'COMMON', 10],
  ['С коя звезда би спал?', 'COMMON', 10],
  ['Кой ти е най-лошият навик?', 'COMMON', 10],
  ['Кога си бил най-мега пиян? Какво стана?', 'COMMON', 10],
  ['Кога те е било най-срам?', 'COMMON', 10],
  ['Кое е най-гнусното нещо, което си правил?', 'COMMON', 10],
  ['Разкажи си за първата целувка.', 'COMMON', 10],
  ['Пърдял ли си в неподходящо време? Кога?', 'COMMON', 10],
  ['Какво мислиш за бездомните безработни хора?', 'COMMON', 10],
  ['Нарушавал ли си закона?', 'COMMON', 5],
  ['Коя ти е най-гадната среща?', 'COMMON', 5],
  ['Лъгал ли си, за да се измъкнеш от гадна среща?', 'COMMON', 5],
  ['Пикал ли си в басейн, гнусар...', 'COMMON', 5],
  ['Срал ли си в басейн, гнусар...', 'COMMON', 5],
  ['Срал ли си в гората, гнусар...', 'COMMON', 5],
  [
    'Тялото ти правило ли е скрийншот? (експорт на телесни течности от горе и отдолу едновременно)',
    'EPIC',
    1,
  ],
  ['Ял ли си гъз?', 'EPIC', 3],
  ['Какъв е твоя фетиш?', 'COMMON', 5],
  ['Кое е най-странното място където си го правил?', 'RARE', 10],
  ['Кога,как и с кого е най-гадното ти сексуално преживяване?', 'RARE', 5],
  ['Правил ли си "Мушкато и Бегония"', 'RARE', 5],
  ['Какво е най-дразнещото в {{randomPlayer}}', 'EPIC', 2],
  [
    'Присъствал ли си, когато някой друг около теб е правил с*кс?',
    'COMMON',
    10,
  ],
  ['Правил ли си джиджи-биджи с повече от един човек едновременно?', 'EPIC', 3],
  ['Правил ли си стрийптийз за своя партньор?', 'RARE', 5],
  ['Кой би целунал в стаята си с изключение на партньора си.', 'RARE', 3],
  [
    'Ако сме в зомби апокалипсис и видиш някво супер секси зомби заклещено в пералнята... би ли? Не е много изгнило.',
    'RARE',
    7,
  ],
  ['Кажи сега... Кога се насра за последно?', 'EPIC', 2],
]
const truth = transformCardArray('TRUTH', truthArray)

export const dareArray: ArrayOfCardArrays = [
  ['Татуирай с химикал/маркер върху ръката си дума с 3 букви.', 'COMMON', 10],
  ['{{randomPlayer}} да ти нарисува мустак с маркер/химикал.', 'COMMON', 10],
  ['Дръпни си вежите с тиксо и стой така 2 рунда.', 'COMMON', 10],
  ['Легни на пода и се престори на пържещ се бекон.', 'COMMON', 10],
  ['Топни си краченцето в тоалетната.', 'COMMON', 6],
  ['{{randomPlayer}} трябва да те гъделичка за 6 секунди.', 'COMMON', 6],
  [
    'Завържи си очите. {{randomPlayer}} трябва да ти сложи нещо в устата. ХРАНА бе мръсник...',
    'COMMON',
    6,
  ],
  [
    'Имитирай някого от играчите, докато нев бъде познат от групата.',
    'COMMON',
    6,
  ],
  ['Сложи си чифт бельо като шапка. Препоръчително е да е твое.', 'COMMON', 10],
  ['Снимай се супер криндж и си смени профилната снимка.', 'EPIC', 1],
  [
    'Нека {{randomPlayer}} залепи тиксо/коламаска на рандъм част от тялото ти и след това да го дръпне с всичка сила. При липса може просто да ти шибне един шамар.',
    'EPIC',
    2,
  ],
  ['Изпей серенада на {{randomPlayer}}', 'EPIC', 6],
  [
    '{{randomPlayer}} трябва да си свали чорапите и ти да ги носиш като ръкавици. Само ако няма гъбички.',
    'EPIC',
    6,
  ],
  [
    'Обърни си всички дрехи наопаки. Сутиените и гащите също. Стой така поне 2 рунда',
    'EPIC',
    5,
  ],
  [
    'Изкарай вътрешния си актьор и влез в дълбок спор със стената. Ако не те слуша я набий.',
    'RARE',
    3,
  ],
  [
    'Завържи очите на {{randomPlayer}} и му дай да целуне 3 предмета.',
    'RARE',
    3,
  ],
  ['Натъпчи си устата с храна и стой така 2 хода', 'COMMON', 3],
  [
    'Изяж една супена лъжица от най-гадния сос в помещението. При липса използвай олио/оцет/зехтин.',
    'RARE',
    2,
  ],
  ['Оближи си големия пръст на крака.', 'COMMON', 10],
  ['Завърти се 10 пъти и се пробвай да ходиш в права линия.', 'COMMON', 6],
  ['Бъркай в кофата и казвай на глас всичко, което хванеш', 'EPIC', 2],
  ['Татуирай с химикал/маркер върху ръката си дума с 3 букви.', 'COMMON', 1],
  ['Отиди отвън и откъсни точно 22 стръка трева с пинцети.', 'EPIC', 1],
  [
    'Помириши мишницата на {{randomPlayer}} и опиши на какво мирише.',
    'RARE',
    1,
  ],
  ['Целуни гума на кола.', 'EPIC', 3],
  ['Направи супер крива физиономия и я дръж за един рунд', 'COMMON', 10],
  ['Сменете си дрехите с {{randomPlayer}}', 'EPIC', 3],
  [
    '{{randomPlayer}} трябва да ти пусне кубче лед на врата/във сутиена',
    'RARE',
    5,
  ],
  ['Оближи дръжка на врата. После дезинфекция.', 'RARE', 1],
  [
    'Обади се на майка си и кажи, че не можеш да си намериш гадже с много паникьосан глас. Може и друг роднина ако майка ти ще те набие.',
    'EPIC',
    1,
  ],
  [
    'Излез отвън и се престори, че косиш ливадата с невидима косачка, която не можеш да удържиш.',
    'EPIC',
    1,
  ],
  [
    'Промириши краката на всеки играч и ги сортирай от най-вонящи до най-свежи.',
    'EPIC',
    1,
  ],
  [
    'Гризни суров картоф. Дъвчи малко, пък ако ти хареса си го дояж...',
    'COMMON',
    5,
  ],
  [
    'Момче: {{randomPlayer}} да ти направи маникюр на едната ръка; Момиче: {{randomPlayer}} да ти нарисува веждите',
    'EPIC',
    1,
  ],
  [
    'Напиши на бившето с гадже: "Все още си мисля за теб нощем преди да заспя."',
    'LEGENDARY',
    1,
  ],
  [
    'Пусни лайв във фейсбук. Взиеми някакъв продукт и започни да четеш етикета със съставките на друг език',
    'LEGENDARY',
    1,
  ],
  ['Излез на двора и се изкрещи "МАМКА МУ, ОСИНОВЕН СЪМ".', 'LEGENDARY', 1],
  [
    'Снимай се с тоалетната чиния и качи снимка в соц. мрежите с надпис "Дамата/кавалера ми за вечерта."',
    'LEGENDARY',
    1,
  ],
  ['Скочи в казан.', 'LEGENDARY', 1],
  [
    'Дай на {{randomPlayer}} да ти прочете браузърната история на глас за 1 минута.',
    'LEGENDARY',
    1,
  ],
  [
    'Оплачи се на майката на партньора си, че партньорът ти не иска да го любиш.',
    'LEGENDARY',
    1,
  ],
  ['{{randomPlayer}} трябва да ти сцепи яйце в главата.', 'LEGENDARY', 1],
]

const dare = transformCardArray('DARE', dareArray)

export const drinkArray: ArrayOfCardArrays = [
  [
    'Дай си наздраве на {{randomPlayer}}. Пийте по една голяма глътка.',
    'COMMON',
    10,
  ],
  [
    'Изпий голям гълток от питието си. Ако нямаш питие ще трябва да си сипеш или да крадеш.',
    'COMMON',
    10,
  ],
  [
    'Изпий един шот със сок от кисели краставици/оцет/лимонов сок (нещо кисело).',
    'RARE',
    5,
  ],
  [
    'Пийни си една глътка от чашата на друг играч. Приоритет имат напитки различни от твоята с по-висок спиртен градус.',
    'COMMON',
    10,
  ],
  [
    'Пий без разредител до края на играта. Ако пиеш глезотии пий по 3 глътки. Ако вече си изтеглил тази карта си изпий чашата до край.',
    'RARE',
    5,
  ],
  ['Смени пиенето за 2 рунда.', 'RARE', 5],
  ['Бомбок! Направи по един шот на всички и го изпийте. (20мл)', 'EPIC', 3],
  [
    'Групово предизвикателсво! Ти избираш пиенето и всички пият по един шот.',
    'EPIC',
    1,
  ],
  [
    'ПИЯН ПОП. Всеки да ти сипе по малко от неговия алкохол. Изпий го.',
    'LEGENDARY',
    1,
  ],
]

const drink = transformCardArray('DRINK', drinkArray)

export const naughtyArray: ArrayOfCardArrays = [
  [
    'Направи обратен стриптийз. Вместо да се събличаш, облечи възможно най-много дрехи и танцувай неловко.',
    'RARE',
    3,
  ],
  ['Целувай се с ръката си. Страстно!', 'RARE', 1],
  ['Махни си чорапите със зъби.', 'COMMON', 10],
  ['Хвани бедрото на човека в дясно. Щипни го и го дръж един рунд.', 'EPIC', 3],
  ['Лази по земята към {{randomPlayer}}, но секси.', 'COMMON', 10],
  ['{{randomPlayer}} трябва да оближе нещо от пръста ти.', 'RARE', 6],
  [
    'Направи си голо селфи и го изпрати на своя партньор. Ако нямаш партньор направи бял камък.',
    'LEGENDARY',
    1,
  ],
  [
    'Другите играчи да застанат на рандъм места. Завъжи си очите и търси някого в стаята. Целуни първият, който хванеш.',
    'LEGENDARY',
    1,
  ],
]

const naughty = transformCardArray('NAUGHTY', naughtyArray)

export const cards: IDeckConstructor['cards'] = [
  ...truth,
  ...dare,
  ...drink,
  ...naughty,
]
